In [4]:
# DemoPandas
from pandas import Series, DataFrame
import pandas as pd

multi = Series( [100,200,300,400,500] )
print(multi)
print(type(multi))

0    100
1    200
2    300
3    400
4    500
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
multi[1]

200

In [10]:
multi = Series( [100,200,300,400,500],
    index=["2024-03-01","2024-03-02","2024-03-03","2024-03-04","2024-03-05"])

print(multi.iloc[0])
print(multi["2024-03-05"])

100
500

In [11]:
import numpy as np

data = np.arange(5)
s = Series(data)
s

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [12]:
data = [1000,2000,3000]
s = Series(data)
s.index = ["메로나", "구구콘", "하겐다즈"]
s

메로나     1000
구구콘     2000
하겐다즈    3000
dtype: int64

In [13]:
s["구구콘"]

2000

In [15]:
type(s.index)

pandas.core.indexes.base.Index

In [16]:
data = [1000,2000,3000]
index = ["메로나", "구구콘", "하겐다즈"]
s = Series(data, index)
s

메로나     1000
구구콘     2000
하겐다즈    3000
dtype: int64

In [18]:
data = [1000,2000,3000]
index = ["메로나", "구구콘", "하겐다즈"]
s = Series(index=index, data=data)
s

메로나     1000
구구콘     2000
하겐다즈    3000
dtype: int64

In [19]:
data = [1000,2000,3000]
index = ["메로나", "구구콘", "하겐다즈"]
s = Series(index=index, data=data)
s2 = s.reindex( ["메로나", "비비빅", "구구콘"] )
s2

메로나    1000.0
비비빅       NaN
구구콘    2000.0
dtype: float64

In [20]:
s2.fillna(0)

메로나    1000.0
비비빅       0.0
구구콘    2000.0
dtype: float64

In [21]:
# 주식데이터
data = { "foreigner":[1, 2, 3, 4, 5, 6], 
         "sratio":[10, 20, 30, 40, 50, 60], 
         "org":[100, 200, 300, 400, 500, 600], 
         "sprice":[1, 2, 3, 4, 5, 6], 
         "private":[10, 20, 30, 40, 50, 60] }

data

{'foreigner': [1, 2, 3, 4, 5, 6],
 'sratio': [10, 20, 30, 40, 50, 60],
 'org': [100, 200, 300, 400, 500, 600],
 'sprice': [1, 2, 3, 4, 5, 6],
 'private': [10, 20, 30, 40, 50, 60]}

In [22]:
frame = DataFrame(data)
frame

   foreigner  sratio  org  sprice  private
0          1      10  100       1       10
1          2      20  200       2       20
2          3      30  300       3       30
3          4      40  400       4       40
4          5      50  500       5       50
5          6      60  600       6       60

In [29]:
frame2 = DataFrame(data, 
    columns=["foreigner", "private", "sratio", "org", "sprice"])
frame2

   foreigner  private  sratio  org  sprice
0          1       10      10  100       1
1          2       20      20  200       2
2          3       30      30  300       3
3          4       40      40  400       4
4          5       50      50  500       5
5          6       60      60  600       6

In [30]:
frame2 = DataFrame(data, 
    columns=["foreigner", "private", "sratio", "org", "sprice"],
    index=["2023-01-03","2023-01-04","2023-01-05","2023-01-06",
        "2023-01-07","2023-01-08"])
frame2

            foreigner  private  sratio  org  sprice
2023-01-03          1       10      10  100       1
2023-01-04          2       20      20  200       2
2023-01-05          3       30      30  300       3
2023-01-06          4       40      40  400       4
2023-01-07          5       50      50  500       5
2023-01-08          6       60      60  600       6

In [31]:
frame2.T

           2023-01-03  2023-01-04  ...  2023-01-07  2023-01-08
foreigner           1           2  ...           5           6
private            10          20  ...          50          60
sratio             10          20  ...          50          60
org               100         200  ...         500         600
sprice              1           2  ...           5           6

[5 rows x 6 columns]

In [32]:
data = {
    "종목Cd":["2","3","5"],
    "종목명":["a","b","c"],
    "현재가":[123,456,789]
}
df = DataFrame(data)
df

  종목Cd 종목명  현재가
0    2   a  123
1    3   b  456
2    5   c  789

In [33]:
data = [
    ["2","3","5"],
    ["a","b","c"],
    [123,456,789]
]
columns = ["종목Cd","종목명","현재가"]
df = DataFrame(data=data, columns=columns)
df

  종목Cd  종목명  현재가
0    2    3    5
1    a    b    c
2  123  456  789

In [34]:
data = [
    ["2","3","5"],
    ["a","b","c"],
    [123,456,789]
]
columns = ["종목Cd","종목명","현재가"]
df = DataFrame(data=data, columns=columns)
df = df.set_index("종목Cd")
df

      종목명  현재가
종목Cd
2       3    5
a       b    c
123   456  789